
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//---------------------- Pride Power------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//* Project Name       : S133
//* File Name          : SOF.c
//* Author             : judy
//* Version            : V1.0.0
//* Start Date         : 2016.2.14
//* Description        : 该文件用于查表计算SOF当前值
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
#include "BMS20.h" 
//******************************************************************************
//* Function name:   linearizationSOF
//* Description:     SOF线性关系公式或查表
//* EntryParameter : 温度值、SOC值，
//* ReturnValue    : 查表得出的最大允许脉冲放电电流
//******************************************************************************
float linearizationSOF(char tem,float soc) 
{
    float curr=0;

    if((tem<=10)||(tem>90))  //<=-30°或>55°
    {
        curr=0;
        return curr;
    }
    if( (tem>10)&&(tem<=20) )//(-30°,-20°] 
    {
        if(soc<=0.1)
            curr=6;
        else if(soc<=0.4)
            curr=18;
        else
            curr=36;
    }
    if( (tem>20)&&(tem<=30) )//(-20°,-10°] 
    {
        if(soc<=0.1)
            curr=36;
        else if(soc<=0.4)
            curr=60;
        else
            curr=96;
    }
    if( (tem>30)&&(tem<=50) )//(-10°,10°] 
    {
        if(soc<=0.1)
            curr=60;
        else if(soc<=0.4)
            curr=120;
        else
            curr=180;
    
    }
    if( (tem>50)&&(tem<=60) )//(10,20]
    {
        if(soc<0.1) 
            curr =60;
        else if(soc<=0.4) 
            curr=144;
        else 
            curr=240;
    }
    
    if( (tem>60)&&(tem<=90) ) //(20,50] 
    {
        if(soc<0.1) 
            curr =120;
        else if(soc<=0.4) 
            curr=144;
        else 
            curr=240;
    }    
 
    return curr;
   
}
//******************************************************************************
//* Function name:   BigDischargePowerAdjust
//* Description:     New SOF 
//* EntryParameter : 温度，SOC，当前最大允许功率或电流值
//* ReturnValue    : bigPowerCurrent当前最大允许放电功率或电流
//******************************************************************************
float BigDischargePowerAdjust(char tem,float soc)
{
    static float power1=0; //放电功率暂存值1
    static float power2=0; //放电功率暂存值2
    static unsigned char counter=0;//2次回馈功率计数
    static unsigned char changeFlag=0;//功率线性变化时标志位
    static unsigned char FirstOn=0;
    float BigDisPower=0; //最大允许放电功率的中间变量，防止查表得到的数中断直接发送
    static float pc=0;//最大允许放电功率/电流 返回值
    
    BigDisPower =linearizationSOF(tem,soc); 

    if(FirstOn==0) //第一次进入
    {
        pc=BigDisPower; 
        power1 = BigDisPower; 
        FirstOn=1;         
    } 
    else//再次进入
    {
        if(changeFlag==0)//原值为0，所以power2为第二次进入该函数时的值
            power2=BigDisPower;
     
        if(power1!=power2) //如果两者不等，说明第一与第二次不等
        {
            changeFlag=1;//设置变化标志位
            if(power1>power2) 
            {
                pc=power1-0.16;// 每20ms变化0.5kw,7ms调用一次，21ms降低0.51KW
                power1=pc;
                if(power1<=power2)
                {
                    
                    pc=power2;
                    changeFlag=0; 
                }
            }
            else if(power1<power2) 
            {
                pc=power1+0.16;// 每5ms变化0.05kw
                power1=pc;
                if(power1>=power2) 
                {
                    
                    pc=power2;
                    changeFlag=0;
                }
            }
        } 
        else 
        {
            changeFlag=0; 
        }
    
    } 
    return pc; 
    
}
//***********************************************************************************************
//************************************************************************************************
//************************************the end*****************************************************
//************************************************************************************************
//***********************************************************************************************
//************************************************************************************************